# Graded: 5 of 5 correct
- [x] Display summary info
- [x] Display nan counts
- [x] Drop nans
- [x] Convert `id` to `int`
- [x] Convert `birthdate` to `datetime`

Comments:

In [1]:
import pandas as pd

The next cell reads in the `dirty_data.csv` file as `data` and displays the first 5 rows.

In [2]:
data = pd.read_csv('dirty_data.csv')
data.head()

,id,name,address,height,birthdate,eyes
0,125500.0,NaN,"94932 Amanda Way\nSouth Cassandraville, WV 15612",158.0,1997-6-21,brown
1,168840.0,Kenneth Waters,"510 Sean Mall Apt. 205\nFarmershire, UT 20150",81.0,1966-10-23,brown
2,224772.0,Nicole Brown,"56984 Edward Parkway\nSchmidtmouth, MA 41988",143.0,1962-9-17,amber
3,254365.0,NaN,"1681 Nicole Ridge Apt. 523\nNew Casey, MH 82120",171.0,1958-12-2,green
4,749255.0,Debbie Murray,59986 Christopher Squares Suite 667\nChristoph...,88.0,1952-12-5,amber

Display the summary information for `data`.

In [5]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 520 entries, 0 to 519
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   id         481 non-null    float64
 1   name       487 non-null    object
 2   address    491 non-null    object
 3   height     486 non-null    float64
 4   birthdate  480 non-null    object
 5   eyes       492 non-null    object
dtypes: float64(2), object(4)
memory usage: 24.5+ KB

Display the number of `NaN` values in each column.

In [6]:
data.isna().sum()

id           39
name         33
address      29
height       34
birthdate    40
eyes         28
dtype: int64

Drop all rows that have `NaN` values and display the first 5 rows of `data`.

In [8]:
print(len(data))
data.dropna(subset=["id", "name", "address", "height", "birthdate", "eyes"], inplace=True)
print(len(data))

520
343

Convert the `id` column to type `int` and the `birthdate` column to type `datetime`. Display the first 5 rows of `data`.

In [12]:
data["id"] = data["id"].astype(int)
data["birthdate"] = pd.to_datetime(data["birthdate"])
data["birthdate"] = data["birthdate"].dt.strftime('%d/%m/%Y')

In [13]:
data.head(5)

,id,name,address,height,birthdate,eyes
1,168840,Kenneth Waters,"510 Sean Mall Apt. 205\nFarmershire, UT 20150",81.0,23/10/1966,brown
2,224772,Nicole Brown,"56984 Edward Parkway\nSchmidtmouth, MA 41988",143.0,17/09/1962,amber
4,749255,Debbie Murray,59986 Christopher Squares Suite 667\nChristoph...,88.0,05/12/1952,amber
6,555484,Michael Rodriguez,"7156 Jackson Turnpike\nGrayburgh, CA 61906",227.0,23/07/1957,brown
7,250463,Michael Bishop,"585 Newman Ville Suite 183\nPort Jillton, NJ 2...",226.0,22/11/1972,blue